{
  "meta": { "theme": "caffeine" },
  "basics": {
    "name": "Sameer Mirza",
    "label": "VP of Engineering",
    "email": "sameerbilal2012@gmail.com",
    "phone": "(805) 617-0769",
    "picture": "https://media-exp1.licdn.com/dms/image/C4D03AQGMdxJeGeScoQ/profile-displayphoto-shrink_400_400/0/1648111641229?e=2147483647&v=beta&t=FF6KH-Y4EZ9Ie4Q_Q5kKcybEziWfSy2_kUdxchcqjXc",
    "location": {
      "address": "34875 Pourroy Rd",
      "postalCode": "CA 92596",
      "city": "Winchester",
      "countryCode": "US",
      "region": "California"
    },
    "summary": "17 years experienced tech enthusiast & mentor that specializes in building engineering teams & enterprise grade scalable software",
    "profiles": [
      {
        "network": "Github",
        "username": "jitcoder",
        "url": "https://github.com/jitcoder"
      },
      {
        "network": "LinkedIn",
        "username": "sameer-mirza-261058a9",
        "url": "https://www.linkedin.com/in/sameer-mirza-261058a9/"
      }
    ]
  },
  "work": [
    {
      "company": "CornerStone Digital",
      "position": "Technical Founder / Engineering Lead",
      "startDate": "2021-04-01",
      "summary": "Built a highlighly efficient digital content distribution system",
      "highlights": [
        "Built a video publishing CMS with a transcoding pipeline that targets low-power devices",
        "Built an ultra-lightweight front-end that minimizes network traffic overhead using spritesheets and vanilla js",
        "The CMS generates multi-resolution spritesheets of video thumbnails and preview images, the front-end then picks and loads one of the spritesheets based off of device resolution",
        "The goal of the above is to enable content distributors to target rural markets with 3G internet speeds and with on average low powered devices"
      ]
    },
    {
      "company": "Loadsy (Paxico Technologies)",
      "position": "Technical Founder / Engineering Lead",
      "startDate": "2021-01-01",
      "endDate": "2022-04-01",
      "summary": "Built a load testing SaaS platform that allows you to write load tests in javascript",
      "highlights": [
        "Lead a small team of engineers to build an ultra-high performance load testing engine",
        "Platform consisted of 4 key components: ",
        "1. Custom scaling system that allows the platform to launch millions of concurrent tests within a very short amount of time",
        "2. IO layer that can perform a high number of HTTP requests without consuming too much CPU",
        "3. Embedded JS Engine (no event loop) that uses the IO layer",
        "4. Statistics pipeline that can ingest a large number of request data and aggregate it quickly to provide real time updates"
      ]
    },
    {
      "company": "Maestro",
      "position": "VP of Engineering - Maestro",
      "website": "https://maestro.io/",
      "startDate": "2020-01-01",
      "endDate":"2021-11-01",
      "summary": "Created processes and infrastructure to allow organization to scale rapidly and grow out of start up phase into an enterprise",
      "highlights": [
        "Drastically improved engineering departments culture leading to a more collaborative environment vs a toxic one",
        "Implemented engineering organizational structure & processes to enable to organization to grow rapidly",
        "Scaled the team from 5 engineers to 40 engineers within 4 months",
        "Created DevOps, SRE & QA departments",
        "Mentored & Trained engineers and developed career growth plans for them",
        "Introduced incident management policies. (On-call rotation, RCAs, incident response handling)",
        "Implemented several 3rd party API integration strategies that significantly reduced bandwidth costs",
        "Introduced & implemented AGILE Scrum enabling the org to get insight into the engineering team and improve delivery times",
        "Collaborated with leadership team to implement pod structure",
        "Created ADR process & ADR Committee to review, discuss & approve implementation details before development starts on it",
        "Drastically reduced tech debt and outages via policies, process and best practices",
        "Standardized release process",
        "Worked with DevOps, SRE & QA departments to create a complex CI/CD pipeline that also runs load tests per release, locking in performance gains with every release",
        "Worked closely with DevOps & Engineering leads to enable the organization to do 'live deployments' rather than depend on release windows",
        "Increased code coverage from <20% to 80%"
      ]
    },
    {
      "company": "Maestro",
      "position": "Director of Engineering - Maestro",
      "website": "https://maestro.io/",
      "startDate": "2019-01-01",
      "endDate": "2019-12-31",
      "summary": "Drastically improved platform scalability, introduced 3-Tier architecture, MapReduce, Domain Driven Design and standardized implementations",
      "highlights": [
        "Trained team on Domain Driven Design and standardized all objects in order to bring data integrity to the platform",
        "Refactored Backend APIs to be more performant, maintainable and easily documented for 3rd party use",
        "Designed 'Stream Provider API Contract' architecture to enable the company to integrate with stream providers (Mux, Wowza, etc..) without eating into dev teams bandwidth. This allowed the company to easily partner with 3rd parties to increase sales",
        "Created a new configuration driven OAuth implementation to allow customers to easily integrate their existing OAuth authentication providers. Previously the dev team was doing manual integrations per OAuth provider",
        "Introduced 3-Tier architecture to help with code maintenance, scalability, incident response and debugging",
        "Refactored backend implementation & infrastructure allowing the platform to scale from 100k concurrents to 2m"
      ]
    },
    {
      "company": "Fox Networks Group",
      "position": "Senior Technology Manager - Fox Networks Group",
      "website": "https://fox.com/",
      "startDate": "2016-09-13",
      "endDate": "2018-12-27",
      "summary": "Worked within the backend engineering team and created site reliability engineering team",
      "highlights": [
        "Built and Lead a 6 person cross functional site reliability engineering team with components in operations, security, release management, QA automation and load testing",
        "Gather requirements from stakeholders and architect technical solutions along with implementation details for various engineering teams",
        "Mentor and onboard new engineering team members in order to achieve quick ramp up of engineering team technical and tribal knowledge",
        "Educator to engineering team and external teams.",
        "Self organized a 10 week Python course for content ops & network ops to help those teams automate their tasks",
        "Started Lunch & Learn sessions to help distribute siloed knowledge across teams",
        "Identified a gap in internal tooling and built internal tools dashboard to help other teams in their tasks",
        "Built a cluster of API Snapshot servers to offload traffic off of degraded server clusters to prevent cascading failures from occurring during record high traffic events",
        "Worked closely with web team to architect solutions for web specific requirements (SEO, Promos etc) and actively prevented development from being blocked",
        "Architected solutions with 3rd party vendor to integrate their recommendations engine with Fox's Content System enabling content editors to create machine learning backed collections",
        "Lead a backend engineering team working on scalable backend solutions built to handle 200k-1.2M requests per minute (Akamai, API Gateway, Docker, NodeJS, ElasticSearch, Mongo, Redis)",
        "Presenter for SoCal React 2017 'Highly Scalable React SPAs'"
      ]
    },
    {
      "company": "Strategic Healthcare Programs (SHP)",
      "position": "Software Engineer - Strategic Healthcare Programs",
      "website": "https://shpdata.com/",
      "startDate": "2014-12-01",
      "endDate": "2016-08-01",
      "highlights": [
        "Provide training/support to peers for new web development technologies. (React & WebAPI)",
        "Architected, Developed & maintained new web applications (full stack)",
        "Maintained & Upgraded legacy software systems (full stack).",
        "Develop & Maintain complex real-time data processing business logic in accordance to CMS (government agency) rules and specifications. (back-end & data layer)"
      ]
    },
    {
      "company": "Bytecode Studios",
      "position": "Software Consultant - Bytecode Studios",
      "website": "https://bytecodestudios.com",
      "startDate": "2013-12-01",
      "endDate": "2014-12-01",
      "highlights": [
        "Architected solutions for various clients",
        "Managed team of developers",
        "Meet with stakeholders to understand requirements and develop software specifications.",
        "Keeping developers up-to-date on new frameworks/platforms"
      ]
    },
    {
      "company": "US Fragrances Inc.",
      "position": "Senior Software Engineer - US Fragrances Inc.",
      "startDate": "2006-11-01",
      "endDate": "2013-12-01",
      "highlights": [
        "Architected, Developed and maintained Point of Sale System with centralized inventory tracking.",
        "Built & Managed team of developers."
      ]
    },
    {
      "company": "Hewlett-Packard",
      "position": "Junior Software Engineer - HP",
      "startDate": "2005-09-01",
      "endDate": "2006-09-01",
      "highlights": [
        "Worked with senior developers on inventory & asset tracking system"
      ]
    }
  ],
  "publications": [
    {
      "name": "Purpose Prep - The Digital Takeover",
      "publisher": "Purpose Prep",
      "releaseDate": "2018-02-01",
      "website": "https://vimeo.com/252279650/d24d90818f",
      "summary": "Internet Of Things – What Is Big Data"
    }
  ],
  "skills": [
    {
      "name": "Management",
      "keywords": [
        "Agile/SCRUM",
        "Leadership",
        "Teacher",
        "Mentor",
        "Executive/Stakeholder communications"
      ]
    },
    {
      "name": "Languages",
      "keywords": [
        "Javascript",
        "Typescript",
        "Go",
        "VB.NET",
        "C#",
        "C/C++",
        "HTML",
        "CSS",
        "SASS",
        "Java",
        "PHP",
        "Pascal (Inno)"
      ]
    },
    {
      "name": "Frameworks / Platforms / Databases",
      "keywords": [
        "GCP",
        "AWS",
        "ECS",
        "Docker",
        "Terraform",
        "Redis",
        "Lerna",
        "Splunk",
        "Grafana",
        "React",
        "React-Native",
        "Angular",
        "JQuery",
        "NodeJS",
        "Mocha",
        "Jasmine",
        "NUnit",
        "Selenium",
        ".NET",
        ".NET Core",
        "ASP.NET",
        "SQL Server",
        "MySQL",
        "Postgres",
        "MongoDB",
        "ElasticSearch"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Urdu",
      "fluency": "Native speaker"
    },
    {
      "language": "Hindi",
      "fluency": "Native speaker"
    }
  ]
}